export const UserInfo={
    name:"Tom",
    level:4,
    phone:"1842811232",
    email:"1842811232@qq.com",
    signature:"我阐释你的梦",
    avatar:require("../img/avatar.jpg"),
    balance:123,
};


export const book=[
    {   id:0,
        date:"2024-1-12",
        publisher:"河南文艺出版社",
        cover:require('../img/城的中国史.jpg'),
        ISBN:"9787555915744",
        title:"城的中国史",
        price:123,
        author:"许宏",
        stock:1445,
        description:"何为“城”？\n" +
            "\n" +
            "中国最早的“城”出现于何时？\n" +
            "\n" +
            "为什么说作为圈围设施的“城”不限于城墙？\n" +
            "\n" +
            "城池为何而建，如何兴建？\n" +
            "\n" +
            "“大都无城”体现了怎样的文化自信？\n" +
            "\n" +
            "……\n" +
            "\n" +
            "人类从穴居到走向开阔地带，再到筑城而居，城垣从无到有又消失，历史上象征着文明的每一步，伟大而深刻，没有比“城”更有烟火味道，更能给人以认同感和归属感了。有关中国历史上城池、城邑、城郭的变迁，无疑是一个让人感兴趣的主题。\n" +
            "\n" +
            "作者的视角从距今9000年的中国最初的城池问世开始，下及秦汉帝国的城市体系，直至明清两代，分为16章，通过历代城池的营建和使用，一窥中国古代文明的兴起与繁盛；并和读者一起，探寻自然与社会中的古人行为，梳理中国早期城市、国家和文明的发展轨迹，进而对中国“大历史”有更明晰的把握，对于我们深刻理解华夏文明的起源与发展，具有重要的现实意义和学术意义。\n"+
            "\n" +
            "全书体量不大，但视野宏阔，9万余字，配有130多幅图片，图文互读，深入浅出。",
        sales:123
    },
    {   id:1,
        date:"2024-2",
        stock:13,
        publisher:"中信出版集团",
        ISBN:"9787521761139",
        cover:require('../img/尾随者.jpg'),
        title:"尾随者",
        price:23,
        author:"默音",
        description: "《尾随者》是默音暌违十年的中短篇小说集。包括8篇小说《镰仓雨日》《酒狂》《暗香》《尾随者》《附加值》《最后一只巧克力麦芬》《模仿者》《迷恋》。离婚后独居日本画插画为生的中年女性、工作之余只爱看书与喝酒的孤僻男子、不断与陌生经验相遇的返沪知青后代、剽窃别人的经历生产爆款的公众号写手……这些人有各自的问题需要面对，而原生家庭与早年生活留下的烙印，也一并影响着今日个体的抉择与行动。\n" +
            "\n" +
            "小说集以“尾随”为关键词，透过对个人记忆和家庭记忆的追溯，让萦绕不散的一切显现，也让读者在他者的经验里看见自我。",
        sales:123
    },
    {   id:2,
        stock:3,
        date:"2024-2",
        publisher:"北京联合出版公司",
        ISBN:"9787559672391",
        cover:require('../img/格.jpg'),
        title:"格",
        price:123,
        author:"随机波动",
        description:"■最受欢迎的中文播客之一“随机波动”首部原创作品\n" +
            "\n" +
            "■从“格”的概念出发，打开想象与思考的边界\n" +
            "\n" +
            "□邀请汪民安、林棹、辽京等知名作者共同创作，精选韩炳哲、费兰特最新力作\n" +
            "\n" +
            "■收录达米恩·赫斯特、路易丝·布尔乔亚、艾格尼丝·马丁等国际顶尖艺术家作品\n" +
            "\n" +
            "□100余幅精致正版图片，四种高级内文纸×高清四色印刷×三种特殊专色\n" +
            "\n" +
            "□数种复杂工艺，多处手工精细装帧，尽显格调美感\n" +
            "\n" +
            "□一本颠覆传统、别具一“格”的主题艺术书\n" +
            "\n" +
            "■从文本到图像，从AI算法到女性书写，共同编织出“格”的多样可能\n" +
            "\n" +
            "□进入“格”，以全新视角审视历史、理解当下；跳出“格”，用创造生发出无限意义",
        sales:123

    },
    {   id:3,
        date:"2024-1",
        publisher:"北京十月文艺出版社",
        stock:5,
        ISBN:"9787530222850",
        cover:require('../img/公开的秘密.jpg'),
        title:"公开的秘密",
        price:123,
        author:"爱丽丝·门罗",
        description:"使我们难以忍受的，并非生活的现状，\n" +
            "\n" +
            "而是生活的另一种可能。\n" +
            "\n" +
            "✧诺贝尔文学奖得主艾丽丝•门罗野心之作，打造独一无二的门罗宇宙\n" +
            "\n" +
            "-获W.H.史密斯文学奖 | 入选《纽约时报》年度好书\n" +
            "\n" +
            "-以彼此交错关联的短篇，向长篇发起挑战：“在《公开的秘密》里面，有些人物会反复出现。凯瑟琳•曼斯菲尔德在她的一封信里说过类似一段话：噢，我希望写出一部长篇小说，我希望我身后不只留下些零碎的故事。” ——门罗自述\n" +
            "\n" +
            "✧打破短篇小说的常规写法，这是属于门罗的系列故事\n" +
            "\n" +
            "-8个短篇，彼此相连，以人物的复现编织交错分岔的命运迷宫\n" +
            "\n" +
            "-偶然的生活：人生随时可以走上岔路，我与世界的关系岌岌可危\n" +
            "\n" +
            "-时间的湍流：打破线性叙事，在跳跃往复中，呈现人们的挣扎、成长、蜕变\n" +
            "\n" +
            "-“生活不仅仅由实际发生的事情组成，也包括幻想中发生的事情，那是与我们所谓的真实的生活如影随形的另一种生活。” ...",
        sales:123
    },
    {   id:4,
        date:"2024-2",
        publisher:"云南人民出版社",
        ISBN:"9787222225954",
        stock:67,
        cover:require('../img/在时间荒原上.jpg'),
        title:"在时间荒原上",
        price:123,
        author:"切斯瓦夫·米沃什",
        description: "☄️ 诺贝尔文学奖得主米沃什三十年散文自选集，中文版首次引进。\n" +
            "\n" +
            "☄️ 同一个世纪，与我们的历史经验更为接近的“另一个欧洲”——“作为一位诗人和一位思想家，米沃什勇于跟他的敌对者共存，仿佛他已告诉自己：要存活于这个时代，只有通过吸收它。”（亚当·扎加耶夫斯基）\n" +
            "\n" +
            "☄️ “但愿你们能原谅我把记忆像伤口一样赤裸裸地揭开”—— “过去几十年发生的事件如此重大，对它们的认知或无知将决定人类未来的命运，但它们却在消散、褪色，失去连贯的逻辑。”在多元文化社会的愿景似乎正在消散的今天，米沃什的文字依旧是我们的一座庇护所。",
        sales:123

    },
    {   id:5,
        date:"2024-3",
        stock:56,
        publisher:"广东人民出版社",
        ISBN:"9787218170220",
        cover:require('../img/夜奔.jpg'),
        title:"夜奔",
        price:123,
        author:"苏生",
        description:"长篇小说《夜奔》是一部当代中国京剧艺术的史诗，是四代女性京剧艺人在时代洪流中的心灵史和生命之书，更是传统中国文化筋骨在80年世代变迁中百折不挠的精神传承。\n" +
            "\n" +
            "小说以武生剧目中极具难度的一出独角戏“林冲夜奔”作为题眼，故事围绕着女武生这一戏曲舞台上少人知晓的存在而展开，以1940年代到当下，从中国到世界的历史和文化巨变作为背景；通过四代女艺人对艺术境界和人生道路的不同追求，把个体命运，家国历史，和对艺术巅峰的探索，融为一体。\n" +
            "\n" +
            "《夜奔》首次以80万字的宏大体量，从女性角度重述了戏曲艺术台前幕后的美轮美奂与艰难险阻。苏生以雄健的笔调，极具传统中国之美的语言，书写了几代女性在时代浪潮中的自我生命觉醒和各不相同的人生选择。在这方赋予她们力量，也标记她们苦痛的舞台背后，流淌着日新月异的时代长河，更矗立着漫长而恒久的华夏美学与中国精神。\n" +
            "\n" +
            "“蒋凤仪”和“蒋雏仪”母女的故事不仅仅关乎艺术，关乎历史，更关乎当代女性的困境与突围。正如舞台上的英雄永不言弃，在“社会”这座大舞台四面八方的每一个女人也许从未摆脱困境，但绝不停止挑战。",
        sales:123
    },
    {   id:6,
        stock:3,
        date:"2024-2",
        publisher:"南海出版公司",
        ISBN:"9787573506115",
        cover:require('../img/如我如鲸.jpg'),
        title:"如我如鲸",
        price:123,
        author: "多琳·坎宁安",
        description: "陷入人生低谷的多琳，带着襁褓中的儿子寄居于妇女收容所，贫困、失业、孤立……一连串的失败让她决定开启一段非同寻常的冒险，寻找人生的方向：一路北上，从墨西哥的潟湖到北极的冰川，她带着儿子跟随哺育幼崽、躲避虎鲸攻击的灰鲸母亲完成了哺乳动物距离最长的大迁徙。\n" +
            "\n" +
            "一路上，多琳寻回了 直面生活变化的勇气与韧性，克服了自我责难，包容了自己的胆怯与犹疑，重获新生。她与一往无前的鲸鱼相伴，重拾对自由、爱与联结的信心。\n" +
            "\n" +
            "行至终点，多琳与久违的自我重逢，六年前的爱与回忆也如潮水般涌来……",
        sales:123
    },
    {   id:7,
        stock:5,
        date:"2024-1-15",
        publisher:"陕西师范大学出版社",
        ISBN:"9787569538427",
        cover:require('../img/我比世界晚熟.jpg'),
        title:"我比世界晚熟",
        price:123,
        author: "胡安焉",
        description: "在我性格、能力和经历等的独特结合形式中，我相信肯定会有一些内容，是从未被人如此生动和清晰地记录过的，我希望这是这部作品的价值所在。\n" +
            "\n" +
            "——胡安焉\n" +
            "\n" +
            "★胡安焉继《我在北京送快递》后的自我剖析之作\n" +
            "\n" +
            "借助这个诚实的人剖析拧巴的自己，他像一面镜子帮助我们每个人看清自己。\n" +
            "\n" +
            "★i人深深共鸣…….\n" +
            "\n" +
            "敏感内向、道德洁癖、社交恐惧、讨好型人格、过度内耗…\n" +
            "\n" +
            "坦述20年换19份工作背后，一个 i人步入社会的内心风暴\n" +
            "\n" +
            "★一个人要走多少路，才能拒绝成为「社会期待的样子」和「自己讨厌的人」?\n" +
            "\n" +
            "逾越成功与失败的度量，对待人生的态度将更丰富、开放和诚实\n" +
            "\n" +
            "★晚熟或早熟的人，都是因自己的人生际遇，拥有自己的生长节奏。\n" +
            "\n" +
            "“人生不是一条通往某个目的的途径，而是所有的经验、感受、思考和领悟本身。”\n" +
            "\n" +
            "“只要是认真度过的日子，我都不认为是蹉跎岁月。”",
        sales:123
    },
    {   id:8,
        stock:7,
        date:"2024-1-9",
        publisher:"新星出版社",
        ISBN:"9787513344180",
        cover:require('../img/阿勒泰的角落.jpg'),
        title:"阿勒泰的角落",
        price:123,
        author:"李娟",
        description: "十九岁，她随家人初入阿尔泰深山牧场，在荒野中经营起半流动的裁缝店和杂货铺。\n" +
            "\n" +
            "牧民自古逐水草而居，为了生活，她与家人也不断随之迁徙——从草场到沙漠、戈壁，甚至是凋敝的废墟。\n" +
            "\n" +
            "踏入新的土地，空空荡荡，而自然丰泽。人有手有脚、感官明晰，就是自由。\n" +
            "\n" +
            "什么都可以从无到有，一点点被创造出来。这样的土地容不下虚伪和矫情，一切都那么直接、真实——世界是未驯服的，感观是纯·天然的。\n" +
            "\n" +
            "哪怕生活永远在一边抛弃，一边继续，只要感受力还在，永远可以发现新的、值得记忆的美好。",
        sales:123
    },
    {   id:9,
        date:"2012-8",
        stock:6,
        publisher:"作家出版社",
        cover:require('../img/活着.jpg'),
        title:"活着",
        ISBN:"9787506365437",
        price:123,
        author:"余华",
        description: "《活着(新版)》讲述了农村人福贵悲惨的人生遭遇。福贵本是个阔少爷，可他嗜赌如命，终于赌光了家业，一贫如洗。他的父亲被他活活气死，母亲则在穷困中患了重病，福贵前去求药，却在途中被国民党抓去当壮丁。经过几番波折回到家里，才知道母亲早已去世，妻子家珍含辛茹苦地养大两个儿女。此后更加悲惨的命运一次又一次降临到福贵身上，他的妻子、儿女和孙子相继死去，最后只剩福贵和一头老牛相依为命，但老人依旧活着，仿佛比往日更加洒脱与坚强。\n" +
            "\n" +
            "《活着(新版)》荣获意大利格林扎纳•卡佛文学奖最高奖项（1998年）、台湾《中国时报》10本好书奖（1994年）、香港“博益”15本好书奖（1994年）、第三届世界华文“冰心文学奖”（2002年），入选香港《亚洲周刊》评选的“20世纪中文小说百年百强”、中国百位批评家和文学编辑评选的“20世纪90年代最有影响的10部作品”。",
        sales:123
    }
]


export const OrderList=[
    {
        id:0,
        phone:1842811232,
        address:"生化斯坦",
        time:"2024/4/6 14:24",
        recipient:"啊啊啊啊",
        detail:[
            {
                cover:book[0].cover,
                title:book[0].title,
                amount:4,
                price:23
            },
            {
                cover:book[1].cover,
                title:book[1].title,
                amount:4,
                price:23
            },
        ],
        payment:123
    },
    {
        id:1,
        phone:1482894732,
        address:"赛博斯坦",
        time:"2024/4/6 14:24",
        recipient:"嗯嗯嗯嗯嗯嗯",
        detail:[
            {
                cover:book[2].cover,
                title:book[2].title,
                amount:3,
                price:444
            },
            {
                cover:book[3].cover,
                title:book[3].title,
                amount:5,
                price:55
            },
        ],
        payment:123
    },
];

export const Cart =[
    {
        id:book[0].id,
        name:book[0].title,
        author:book[0].author,
        amount:2,
        price:book[0].price,
        cover:book[0].cover,
        description:book[0].description,
    },
    {

        id:book[1].id,
        name:book[1].title,
        author:book[1].author,
        amount:3,
        price:book[1].price,
        cover:book[1].cover,
        description:book[1].description
    },
    {

        id:book[2].id,
        name:book[2].title,
        author:book[2].author,
        amount:4,
        price:book[2].price,
        cover:book[2].cover,
        description:book[2].description
    },
    {

        id:book[3].id,
        name:book[3].title,
        author:book[3].author,
        amount:1,
        price:book[3].price,
        cover:book[3].cover,
        description:book[3].description
    },
];